In [1]:
import pandas as pd

## cumulative statics

In [15]:
sales = pd.read_csv('data/Data Manipulation/sales_subset.csv')
sales.head()

,Unnamed: 0,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
1,1,1,A,1,2010-03-05,21827.90,False,8.055556,0.693452,8.106
2,2,1,A,1,2010-04-02,57258.43,False,16.816667,0.718284,7.808
3,3,1,A,1,2010-05-07,17413.94,False,22.527778,0.748928,7.808
4,4,1,A,1,2010-06-04,17558.09,False,27.050000,0.714586,7.808

In [16]:
sales['date'].max()

'2012-10-26'

In [17]:
sales['unemployment'].mean()

8.08200863189159

In [18]:
def pct30(column):
    return column.quantile(0.3)

sales['fuel_price_usd_per_l'].agg(pct30)

0.7135290496934282

## Cumulative statiscs

In [19]:
sales['weekly_sales'].cumsum()

0        2.492450e+04
1        4.675240e+04
2        1.040108e+05
3        1.214248e+05
4        1.389829e+05
             ...
10769    2.568930e+08
10770    2.568934e+08
10771    2.568938e+08
10772    2.568938e+08
10773    2.568947e+08
Name: weekly_sales, Length: 10774, dtype: float64

In [20]:
sales['weekly_sales'].cummax()

0         24924.50
1         24924.50
2         57258.43
3         57258.43
4         57258.43
           ...
10769    293966.05
10770    293966.05
10771    293966.05
10772    293966.05
10773    293966.05
Name: weekly_sales, Length: 10774, dtype: float64

## Counting

In [23]:
store_types = sales.drop_duplicates(subset=['store','type'])
store_types.head()

,Unnamed: 0,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
901,901,2,A,1,2010-02-05,35034.06,False,4.550000,0.679451,8.324
1798,1798,4,A,1,2010-02-05,38724.42,False,6.533333,0.686319,8.623
2699,2699,6,A,1,2010-02-05,25619.00,False,4.683333,0.679451,7.259
3593,3593,10,B,1,2010-02-05,40212.84,False,12.411111,0.782478,9.765

In [24]:
store_depts = sales.drop_duplicates(subset=['store','department'])
store_depts.head()

,Unnamed: 0,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
12,12,1,A,2,2010-02-05,50605.27,False,5.727778,0.679451,8.106
24,24,1,A,3,2010-02-05,13740.12,False,5.727778,0.679451,8.106
36,36,1,A,4,2010-02-05,39954.04,False,5.727778,0.679451,8.106
48,48,1,A,5,2010-02-05,32229.38,False,5.727778,0.679451,8.106

In [25]:
holiday_dates = sales[sales['is_holiday']].drop_duplicates(subset='date')
holiday_dates['date']

498     2010-09-10
691     2011-11-25
2315    2010-02-12
6735    2012-09-07
6810    2010-12-31
6815    2012-02-10
6820    2011-09-09
Name: date, dtype: object

In [28]:
store_counts = store_types['type'].value_counts()
store_counts

type
A    11
B     1
Name: count, dtype: int64

In [29]:
store_props = store_types['type'].value_counts(normalize=True)
store_props

type
A    0.916667
B    0.083333
Name: proportion, dtype: float64

In [30]:
dept_counted_sorted = store_depts['department'].value_counts(sort=True)
dept_counted_sorted

department
1     12
55    12
72    12
71    12
67    12
      ..
37    10
48     8
50     6
39     4
43     2
Name: count, Length: 80, dtype: int64

In [33]:
dept_props_sorted = store_depts['department'].value_counts(sort=True, normalize=True)
dept_props_sorted

department
1     0.012917
55    0.012917
72    0.012917
71    0.012917
67    0.012917
        ...
37    0.010764
48    0.008611
50    0.006459
39    0.004306
43    0.002153
Name: proportion, Length: 80, dtype: float64

In [35]:
sales_all = sales['weekly_sales'].sum()
sales_all

256894718.89999998

In [36]:
sales_A = sales[sales['type'] == 'A']['weekly_sales'].sum()
sales_A

233716315.01

In [38]:
sales_B = sales[sales['type'] == 'B']['weekly_sales'].sum()
sales_B

23178403.89

In [39]:
sales_C = sales[sales['type'] == 'C']['weekly_sales'].sum()
sales_C

0.0

In [40]:
sales_propn_by_type = [sales_A,sales_B,sales_C] / sales_all
sales_propn_by_type

array([0.9097747, 0.0902253, 0.       ])

In [41]:
sales_by_type = sales.groupby('type')['weekly_sales'].sum()
sales_by_type

type
A    2.337163e+08
B    2.317840e+07
Name: weekly_sales, dtype: float64

In [42]:
sales_propn_by_type = sales_by_type / sum(sales_by_type)
sales_propn_by_type

type
A    0.909775
B    0.090225
Name: weekly_sales, dtype: float64

In [43]:
sales_by_type_is_holiday = sales.groupby(['type','is_holiday'])['weekly_sales'].sum()
sales_by_type_is_holiday

type  is_holiday
A     False         2.336927e+08
      True          2.360181e+04
B     False         2.317678e+07
      True          1.621410e+03
Name: weekly_sales, dtype: float64

In [44]:
import numpy as np
sales_stats = sales.groupby('type')['weekly_sales'].agg([min,max,np.mean,np.median]) 
sales_stats

         min        max          mean    median
type
A    -1098.0  293966.05  23674.667242  11943.92
B     -798.0  232558.51  25696.678370  13336.08

## Pivot table
1. values -> column to summarize
2. index -> columns that use for group by
3. by default mean
4. aggfunc -> pass the function for summarize
5. columns -> use to pass 2nd column as group by

In [46]:
mean_sales_by_type = sales.pivot_table(values='weekly_sales',index='type')
mean_sales_by_type

      weekly_sales
type
A     23674.667242
B     25696.678370

In [47]:
mean_med_sales_by_type = sales.pivot_table(values='weekly_sales',index='type',aggfunc=[np.mean,np.median])
mean_med_sales_by_type

              mean       median
      weekly_sales weekly_sales
type
A     23674.667242     11943.92
B     25696.678370     13336.08

In [48]:
mean_sales_by_type_holiday = sales.pivot_table(values='weekly_sales', index='type', columns='is_holiday')
mean_sales_by_type_holiday

is_holiday         False      True
type
A           23768.583523  590.04525
B           25751.980533  810.70500

In [49]:
sales.pivot_table(values='weekly_sales', index='type', columns='department',fill_value=-0)

department,1,2,3,4,5,6,7,8,9,10,...,90,91,92,93,94,95,96,97,98,99
type,,,,,,,,,,,,,,,,,,,,,
A,30961.725379,67600.158788,17160.002955,44285.399091,34821.011364,7136.292652,38454.336818,48583.475303,30120.449924,30930.456364,...,85776.905909,70423.165227,139722.204773,53413.633939,60081.155303,123933.787121,21367.042857,28471.266970,12875.423182,379.123659
B,44050.626667,112958.526667,30580.655000,51219.654167,63236.875000,10717.297500,52909.653333,90733.753333,66679.301667,48595.126667,...,14780.210000,13199.602500,50859.278333,1466.274167,161.445833,77082.102500,9528.538333,5828.873333,217.428333,0.000000

In [50]:
sales.pivot_table(values='weekly_sales', index='type', columns='department',fill_value=0, margins=True)

department,1,2,3,4,5,6,7,8,9,10,...,91,92,93,94,95,96,97,98,99,All
type,,,,,,,,,,,,,,,,,,,,,
A,30961.725379,67600.158788,17160.002955,44285.399091,34821.011364,7136.292652,38454.336818,48583.475303,30120.449924,30930.456364,...,70423.165227,139722.204773,53413.633939,60081.155303,123933.787121,21367.042857,28471.266970,12875.423182,379.123659,23674.667242
B,44050.626667,112958.526667,30580.655000,51219.654167,63236.875000,10717.297500,52909.653333,90733.753333,66679.301667,48595.126667,...,13199.602500,50859.278333,1466.274167,161.445833,77082.102500,9528.538333,5828.873333,217.428333,0.000000,25696.678370
All,32052.467153,71380.022778,18278.390625,44863.253681,37189.000000,7434.709722,39658.946528,52095.998472,33167.020903,32402.512222,...,65654.535000,132316.960903,49084.687292,55087.846181,120029.480069,20337.607681,26584.400833,11820.590278,379.123659,23843.950149